In [1]:
%load_ext sql

In [2]:
%env DATABASE_URL=postgresql://admin:Itversity123@retail-wg.269066542444.us-east-1.redshift-serverless.amazonaws.com:5439/dev

env: DATABASE_URL=postgresql://admin:Itversity123@retail-wg.269066542444.us-east-1.redshift-serverless.amazonaws.com:5439/dev

In [3]:
%%sql

SELECT * 
FROM retail_db.orders 
LIMIT 10;

10 rows affected.

[(1, '2013-07-25 00:00:00.0', 11599, 'CLOSED'),
 (2, '2013-07-25 00:00:00.0', 256, 'PENDING_PAYMENT'),
 (3, '2013-07-25 00:00:00.0', 12111, 'COMPLETE'),
 (4, '2013-07-25 00:00:00.0', 8827, 'CLOSED'),
 (5, '2013-07-25 00:00:00.0', 11318, 'COMPLETE'),
 (6, '2013-07-25 00:00:00.0', 7130, 'COMPLETE'),
 (7, '2013-07-25 00:00:00.0', 4530, 'COMPLETE'),
 (8, '2013-07-25 00:00:00.0', 2911, 'PROCESSING'),
 (9, '2013-07-25 00:00:00.0', 5657, 'PENDING_PAYMENT'),
 (10, '2013-07-25 00:00:00.0', 5648, 'PENDING_PAYMENT')]

In [4]:
%%sql

SELECT order_status,
	count(*) AS order_count
FROM retail_db.orders
GROUP BY order_status
ORDER BY order_status;

 * postgresql://admin:***@retail-wg.269066542444.us-east-1.redshift-serverless.amazonaws.com:5439/dev
9 rows affected.

[('CANCELED', 1428),
 ('CLOSED', 7556),
 ('COMPLETE', 22899),
 ('ON_HOLD', 3798),
 ('PAYMENT_REVIEW', 729),
 ('PENDING', 7610),
 ('PENDING_PAYMENT', 15030),
 ('PROCESSING', 8275),
 ('SUSPECTED_FRAUD', 1558)]

In [5]:
%%sql

SELECT * 
FROM retail_db.order_items
LIMIT 10;

 * postgresql://admin:***@retail-wg.269066542444.us-east-1.redshift-serverless.amazonaws.com:5439/dev
10 rows affected.

[(1, 1, 957, 1, 299.98, 299.98),
 (2, 2, 1073, 1, 199.99, 199.99),
 (3, 2, 502, 5, 250.0, 50.0),
 (4, 2, 403, 1, 129.99, 129.99),
 (5, 4, 897, 2, 49.98, 24.99),
 (6, 4, 365, 5, 299.95, 59.99),
 (7, 4, 502, 3, 150.0, 50.0),
 (8, 4, 1014, 4, 199.92, 49.98),
 (9, 5, 957, 1, 299.98, 299.98),
 (10, 5, 365, 5, 299.95, 59.99)]

In [6]:
%%sql

SELECT order_item_order_id,
	round(sum(order_item_subtotal), 2) AS order_revenue
FROM retail_db.order_items
GROUP BY order_item_order_id
ORDER BY order_item_order_id
LIMIT 10;

 * postgresql://admin:***@retail-wg.269066542444.us-east-1.redshift-serverless.amazonaws.com:5439/dev
10 rows affected.

[(1, 299.98),
 (2, 579.98),
 (4, 699.85),
 (5, 1129.86),
 (7, 579.92),
 (8, 729.84),
 (9, 599.96),
 (10, 651.92),
 (11, 919.79),
 (12, 1299.87)]

In [7]:
%%sql

SELECT order_item_order_id,
	round(sum(order_item_subtotal), 2) AS order_revenue
FROM retail_db.order_items
GROUP BY order_item_order_id
	HAVING round(sum(order_item_subtotal), 2) > 1000
ORDER BY order_item_order_id
LIMIT 10;

 * postgresql://admin:***@retail-wg.269066542444.us-east-1.redshift-serverless.amazonaws.com:5439/dev
10 rows affected.

[(5, 1129.86),
 (12, 1299.87),
 (28, 1159.9),
 (29, 1109.85),
 (62, 1149.94),
 (73, 1279.65),
 (84, 1499.87),
 (99, 1099.93),
 (107, 1039.95),
 (121, 1029.93)]